Repository: pombredanne/file_archive
Catalog: po/*.po
Languages: fr_fr

source: Metadata should have format key=value, key=type:value (eg. age=int:23) or key=type:req (eg. age=int:>21)
fr_fr: Les métadonnées doivent être dans le format clef=valeur, clef=type:valeur (ex age=int:23) ou clef=type:requête (ex age=int:>18)

source: Metadata has unknown type '{t}'! Only 'str' and 'int' are supported. If you meant a string with a ':', use 'str:mystring'
fr_fr: Une métadonnée a un type inconnu '{t}' ! Seuls "str" et "int" sont supportés. Si vous vouliez une chaîne contenant un ":", utilisez "str:chaine".

source: Differing types for conditions on key {k}: {t1}, {t2}
fr_fr: Types différents pour les conditions sur la clef {k} : {t1}, {t2}

source: Multiple conditions {cond} on key {k}
fr_fr: Plusieurs conditions {cond} sur la clef {k}

source: Metadata should have format key=value or key=type:value (eg. age=int:23)
fr_fr: Les métadonnées doivent être dans le format clef=valeur ou clef=type:valeur (ex age=int:23)

source: Missing filename
fr_fr: Nom de fichier manquant

source: Path does not exist: {path}
fr_fr: Le nom de fichier n'existe pas : {path}

source: Unknown option: {opt}
fr_fr: Option inconnue : {opt}

source: Objectid not found
fr_fr: Objectid introuvable

source: No match found
fr_fr: Aucune correspondance

source: Warning: more matching files exist
fr_fr: Attention : il y a plusieurs fichiers correspondant

source: Error: match found but is a directory
fr_fr: Erreur : correspondance trouvée mais c'est un dossier

source: Error: not removing files unconditionally unless -f is given (command would have removed {nb} files)
fr_fr: Erreur : pas de suppression inconditionnelle sauf si -f est passé (la commande aurait supprimé {nb} fichiers)

source: verify command accepts no argument
fr_fr: La commande verify n'accepte aucun paramètre

source: view command accepts no argument
fr_fr: La commande view n'accepte aucun paramètre

source: usage: {bin} <store> create or: {bin} <store> add <filename> [key1=value1] [...] or: {bin} <store> write [key1=value1] [...] or: {bin} <store> query [-d] [-t] [key1=value1] [...] or: {bin} <store> print [-m] [-t] <filehash> [...] or: {bin} <store> print [-m] [-t] [key1=value1] [...] or: {bin} <store> remove [-f] <filehash> or: {bin} <store> remove [-f] <key1=value1> [...] or: {bin} <store> verify or: {bin} <store> view
fr_fr: utilisation : {bin} <dépôt> create ou: {bin} <dépôt> add <fichier> [clef1=valeur1] [...] ou: {bin} <dépôt> write [clef1=valeur1] [...] ou: {bin} <dépôt> query [-d] [-t] [clef1=valeur1] [...] ou: {bin} <dépôt> print [-m] [-t] <hash> [...] ou: {bin} <dépôt> print [-m] [-t] [clef1=valeur1] [...] ou: {bin} <dépôt> remove [-f] <hash> ou: {bin} <dépôt> remove [-f] <clef1=valeur1> [...] ou: {bin} <dépôt> verify ou: {bin} <dépôt> view

source: Can't create store: {err}
fr_fr: Impossible de créer le dépôt {err}

source: Invalid store: {err}
fr_fr: Dépôt invalide : {err}

source: file_archive viewer
fr_fr: Explorateur de file_archive

source: Enter query here
fr_fr: Entrez la requête ici

source: Search
fr_fr: Rechercher

source: Key
fr_fr: Clef

source: Value
fr_fr: Valeur

source: Open
fr_fr: Ouvrir

source: Copy ID
fr_fr: Copier l'ID

source: Edit metadata...
fr_fr: Editer les métadonnées...

source: Delete
fr_fr: Supprimer

source: objectid '{oid}' not found
fr_fr: objectid '{oid}' introuvable

source: ... stripped after {nb} results...
fr_fr: ... limité à {nb} résultats...

source: No matches
fr_fr: Aucune correspondance

source: Are you sure?
fr_fr: Êtes-vous certain ?

source: You are about to delete {num} entry from the store. Please confirm.
fr_fr: Vous êtes sur le point de supprimer {num} entrée depuis le dépôt. Merci de confirmer.

source: Editing entry %s
fr_fr: Edition de l'entrée %s

source: Remove original entry
fr_fr: Supprimer l'entrée originale

source: Create new entry
fr_fr: Créer l'entrée

source: Cancel
fr_fr: Annuler

source: Replace entry
fr_fr: Remplacer l'entrée

source: Empty key
fr_fr: Clef vide

source: Invalid int value for %(key)s (row %(row)d)
fr_fr: Valeur numérique invalide pour %(key)s (ligne %(row)d)

source: Invalid type (row %d)
fr_fr: Type invalide (ligne %d)

source: Duplicate key %s
fr_fr: Clef en double %s

source: Invalid values
fr_fr: Valeurs invalides
